<a href="https://colab.research.google.com/github/YahiaML/W3scools-R-course/blob/main/L_17_Data_Frames_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Forming a Data Frame

In [ ]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)

df

  Name  Age
1 Yahia 21
2 Abdo  20
3 Ammar 19
4 Saeed 20
5 Waeel 20

#Summarize the Data

In [ ]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)

summary(df)

     Name                Age
 Length:5           Min.   :19
 Class :character   1st Qu.:20
 Mode  :character   Median :20
                    Mean   :20
                    3rd Qu.:20
                    Max.   :21

#Access Items

In [3]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)
print("# Access the first column")
df[1]          # Access the first column

print("# Access the first row")
df[1,]         # Access the first row

print("# Access the third row in the second column")
df[3,2]        # Access the third row in the second column
print("# Access the column by its name")
df["Name"]     # Access the column by its name
df$Name        # Access the column by its name

[1] "# Access the first column"

  Name
1 Yahia
2 Abdo
3 Ammar
4 Saeed
5 Waeel

[1] "# Access the first row"

  Name  Age
1 Yahia 21

[1] "# Access the third row in the second column"

[1] 19

[1] "# Access the column by its name"

  Name
1 Yahia
2 Abdo
3 Ammar
4 Saeed
5 Waeel

[1] "Yahia" "Abdo"  "Ammar" "Saeed" "Waeel"

# Add Rows

In [ ]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)

df <- rbind(df, c("Mohannad", 20))
df

# Add an empty row
df[nrow(df)+1,] <- NA
df

  Name     Age
1 Yahia    21
2 Abdo     20
3 Ammar    19
4 Saeed    20
5 Waeel    20
6 Mohannad 20

  Name     Age
1 Yahia    21
2 Abdo     20
3 Ammar    19
4 Saeed    20
5 Waeel    20
6 Mohannad 20
7 NA       NA

# Add columns

In [ ]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)

df$College <- c("science", "computer sci.", "Engineering", "computer sci.", "Engineering")

df

  Name  Age College
1 Yahia 21  science
2 Abdo  20  computer sci.
3 Ammar 19  Engineering
4 Saeed 20  computer sci.
5 Waeel 20  Engineering

#Remove rows and columns

In [ ]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20),
  College = c("science", "computer sci.", "Engineering", "computer sci.", "Engineering")
)

df_removed_column <- df[-c(3)]        # Remove columns
df_removed_column

df_removed_row <- df[-c(1),]          # Remove rows
df_removed_row

  Name  Age
1 Yahia 21
2 Abdo  20
3 Ammar 19
4 Saeed 20
5 Waeel 20

  Name  Age College
2 Abdo  20  computer sci.
3 Ammar 19  Engineering
4 Saeed 20  computer sci.
5 Waeel 20  Engineering

In [ ]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20),
  College = c("science", "computer sci.", "Engineering", "computer sci.", "Engineering")
)

df_removed_column <- subset(df, select = -c(College) )       # Remove a column by name
df_removed_column

  Name  Age
1 Yahia 21
2 Abdo  20
3 Ammar 19
4 Saeed 20
5 Waeel 20

# Remove empty rows

In [ ]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)

# Add an empty row
df[nrow(df)+1,] <- NA
df

# Remove the empty row
df <- na.omit(df)
df

  Name  Age
1 Yahia 21
2 Abdo  20
3 Ammar 19
4 Saeed 20
5 Waeel 20
6 NA    NA

  Name  Age
1 Yahia 21
2 Abdo  20
3 Ammar 19
4 Saeed 20
5 Waeel 20

# Change column name

In [ ]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20),
  College = c("science", "computer sci.", "Engineering", "computer sci.", "Engineering")
)

names(df)[3] <- "Studying"
df

  Name  Age Studying
1 Yahia 21  science
2 Abdo  20  computer sci.
3 Ammar 19  Engineering
4 Saeed 20  computer sci.
5 Waeel 20  Engineering

#Number of Rows and Columns

In [ ]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20)
)


dim(df)
nrow(df)
ncol(df)

[1] 5 2

[1] 5

[1] 2

#Data frame Length

In [ ]:
df <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20),
  College = c("science", "computer sci.", "Engineering", "computer sci.", "Engineering")
)

length(df)

[1] 3

# Combining Data Frames

In [ ]:
df1 <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20),
  College = c("science", "computer sci.", "Engineering", "computer sci.", "Engineering")
)

df2 <- data.frame (
  Name = c("Mohannad", "Anas"),
  Age = c(20, 20),
  College = c("computer sci.", "Commerce")
)

df3 <- rbind(df1, df2)       #with the same columns
df3

  Name     Age College
1 Yahia    21  science
2 Abdo     20  computer sci.
3 Ammar    19  Engineering
4 Saeed    20  computer sci.
5 Waeel    20  Engineering
6 Mohannad 20  computer sci.
7 Anas     20  computer sci.

In [ ]:
df1 <- data.frame (
  Name = c("Yahia", "Abdo", "Ammar", "Saeed", "Waeel"),
  Age = c(21, 20, 19, 20, 20),
  College = c("science", "computer sci.", "Engineering", "computer sci.", "Engineering")
)

df2 <- data.frame (
  GPA = c(2.0, 2.9, 2.5, 1.9, 2.9),
  Sports = c("calisthenics", "Foot ball", "Foot ball", "Foot ball", "Foot ball")
)

df3 <- cbind(df1, df2)       #with the same columns
df3

  Name  Age College       GPA Sports
1 Yahia 21  science       2.0 calisthenics
2 Abdo  20  computer sci. 2.9 Foot ball
3 Ammar 19  Engineering   2.5 Foot ball
4 Saeed 20  computer sci. 1.9 Foot ball
5 Waeel 20  Engineering   2.9 Foot ball